TerryFogg/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL.cpp
//
// Copyright (c) .NET Foundation and Contributors
// See LICENSE file in the project root for full license information.
//

#include <esp32_os.h>
#include <nanoPAL.h>
#include <nanoHAL_Time.h>
#include <nanoHAL_Types.h>
#include <target_platform.h>
#include <target_board.h>
#include <nanoPAL_Events.h>
#include <nanoPAL_BlockStorage.h>
#include <nanoHAL_ConfigurationManager.h>
#include <nanoHAL_Graphics.h>
#include "sys_dev_i2c_native_target.h"
#include "Debug_To_Display.h"
#include "TouchPanel.h"

void Storage_Initialize();
void Storage_Uninitialize();

extern "C" void FixUpHalSystemConfig();
extern "C" void FixUpBlockRegionInfo();
extern TouchPanelDriver g_TouchPanelDriver;

//
//  Reboot handlers clean up on reboot
//
static ON_SOFT_REBOOT_HANDLER s_rebootHandlers[16] =
    {NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL};

void HAL_AddSoftRebootHandler(ON_SOFT_REBOOT_HANDLER handler)
{
    for (unsigned int i = 0; i < ARRAYSIZE(s_rebootHandlers); i++)
    {
        if (s_rebootHandlers[i] == NULL)
        {
            s_rebootHandlers[i] = handler;
            return;
        }
        else if (s_rebootHandlers[i] == handler)
        {
            return;
        }
    }
}

// because nanoHAL_Initialize/Uninitialize needs to be called in both C and C++ we need a proxy to allow it to be called
// in 'C'
extern "C"
{
    void nanoHAL_Initialize_C()
    {
        nanoHAL_Initialize();
    }
    void nanoHAL_Uninitialize_C()
    {
        nanoHAL_Uninitialize();
    }
}

void nanoHAL_Initialize()
{
    CPU_GPIO_Initialize();
#if (HAL_USE_SPI == TRUE)
    nanoSPI_Initialize();
#endif

// Initialise Graphics as soon as possible after devices defined
#if (NANOCLR_GRAPHICS == TRUE)
    PalEvent_Initialize();
    InitializeGraphics();
#endif

    HAL_CONTINUATION::InitializeList();
    HAL_COMPLETION ::InitializeList();

    // Fixup System & Block storage parameters based on Flash chip and partition layout
    FixUpHalSystemConfig();
    FixUpBlockRegionInfo();

    lcd_printf("Fixup System & Block storage parameters\n");

    // initialize block storage devices
    BlockStorageList_Initialize();
    BlockStorage_AddDevices();
    BlockStorageList_InitializeDevices();

    // allocate & clear managed heap region
    unsigned char *heapStart = NULL;
    unsigned int heapSize = 0;

    lcd_printf("llocate & clear managed heap region\n");
    ::HeapLocation(heapStart, heapSize);
    memset(heapStart, 0, heapSize);

    lcd_printf("Initialize Configuration\n");
    ConfigurationManager_Initialize();

    lcd_printf("Initialize Events\n");
    Events_Initialize();

    lcd_printf("Initialize Storage\n");
    Storage_Initialize();

    lcd_printf("Initialize Network\n");
    Network_Initialize();

    lcd_printf("TargetHAL: Target HAL complete\n");

    //while (true)
    //{
    //   TouchPointDevice t = g_TouchDevice.GetPoint();

    //   lcd_printf("[%d,%d]  - %d \n", t.x, t.y, g_TouchPanelDriver.TouchInterruptOccured);
    //}

}

void nanoHAL_Uninitialize()
{
    // check for s_rebootHandlers
    for (unsigned int i = 0; i < ARRAYSIZE(s_rebootHandlers); i++)
    {
        if (s_rebootHandlers[i] != NULL)
        {
            s_rebootHandlers[i]();
        }
        else
        {
            break;
        }
    }

    Storage_Uninitialize();

    SOCKETS_CloseConnections();

#if !defined(HAL_REDUCESIZE)
    // TODO need to call this but it's preventing the debug session from starting
    // Network_Uninitialize();
#endif

    BlockStorageList_UnInitializeDevices();

#if (HAL_USE_SPI == TRUE)
    nanoSPI_Uninitialize();
#endif

    CPU_GPIO_Uninitialize();

    // PalEvent_Uninitialize();

    Events_Uninitialize();

    HAL_CONTINUATION::Uninitialize();
    HAL_COMPLETION ::Uninitialize();
}

// Just in case storage is not configured
__nfweak void Storage_Initialize(){};
__nfweak void Storage_Uninitialize(){};